---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.TextPosition
source: html/078cf0bc-d3a2-8298-234f-a204f7fa0058.htm
---
# Autodesk.Revit.DB.ParameterTypeId.TextPosition Property

"Text Position"

## Syntax (C#)
```csharp
public static ForgeTypeId TextPosition { get; }
```